In [13]:
import pandas as pd

#create data-frame
employee_df = pd.DataFrame({'id': [1,2,3,4,5,6,7],
                   'name': ['Joe', 'Henry', 'Sam', 'Max', 'Janet', 'Randy', 'Will'],
                   'salary' : [85000, 80000, 60000, 90000, 69000, 85000, 70000],
                    'departmentId' : [1,2,2,1,1,1,1]
                  })

In [14]:
employee_df

   id   name  salary  departmentId
0   1    Joe   85000             1
1   2  Henry   80000             2
2   3    Sam   60000             2
3   4    Max   90000             1
4   5  Janet   69000             1
5   6  Randy   85000             1
6   7   Will   70000             1

In [15]:
#create DataFrame
dept_df = pd.DataFrame({'id': [1,2],
                   'name': ['IT', 'Sales']
                  })

In [16]:
dept_df

   id   name
0   1     IT
1   2  Sales

who earns the most money in each of the company's departments. A high earner in a 
department is an employee who has a salary in the top three unique salaries for that department.

Write an SQL query to find the employees who are high earners in each of the departments.

In [17]:
import sqlite3

# create connection to in memory sqlite db
conn = sqlite3.connect(":memory:")

# save prices dataframe to sqlite db
employee_df.to_sql(name="Employee", con=conn, index=False)
dept_df.to_sql(name="Department", con=conn, index=False)

In [24]:
query = """
  
 WITH Rank_Table AS ( 
    SELECT d.name AS Department,
           e.name AS Employee,
           e.salary as Salary,
           DENSE_RANK() OVER(PARTITION BY d.name ORDER BY e.salary DESC) AS Rank
    FROM Employee e
    JOIN Department d
    ON e.departmentID = d.id)
    
SELECT Department, Employee, Salary 
FROM Rank_Table
WHERE Rank <= 3
    
"""

In [25]:
# use pandas read_sql to execute the query and return a dataframe
result_df = pd.read_sql(query, con=conn)

In [26]:
result_df

  Department Employee  Salary
0         IT      Max   90000
1         IT      Joe   85000
2         IT    Randy   85000
3         IT     Will   70000
4         IT    Janet   69000
5      Sales    Henry   80000
6      Sales      Sam   60000